dachan/workspace-esp32/ai-model-control/sdkconfig.defaults
# Lonely Binary ESP32-S3 N16R8 class board with 3.5" ST7796U SPI panel.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# App data (MODEL lines) uses USB Serial/JTAG via the driver API.
# Keep the primary console on UART0 so the USB port is free for the bridge.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
